/**
 * Задача 1.
 *
 * Напишите функцию `inspect`, которая будет принимать массив в качестве аргумента,
 * и возвращать новый массив.
 * Этот новый массив должен содержать исключительно длины строк, которые были в
 * переданном массиве.
 * Если строк в переданном массиве не было — нужно вернуть пустой массив.
 * 
 * Условия:
 * - Обязательно использовать встроенный метод массива filter;
 * - Обязательно использовать встроенный метод массива map.
 *
 * Генерировать ошибки, если:
 * - При вызове функции не был передан один аргумент;
 * - В качестве первого аргумента был передан не массив.
 */

const array = [
    false,
    'Привет.',
    2,
    'Здравствуй.',
    [],
    'Прощай.',
    {
        name: 'Уолтер',
        surname: 'Уайт',
    },
    'Приветствую.',
];


// Решение
function inspect(arr){    
    if(!Array.isArray(arguments[0])){
        throw new Error('В качестве первого аргумента функции inspect был передан не массив!');
    }
    if(arguments.length !== 1){
        throw new Error('При вызове функции inspect не был передан один аргумент!');
    }
    return (arr.filter(function(x){return typeof x === 'string' ? true:false})).map(function(x){return x.length});//на мой взгляд это читабельно
}


//console.log(inspect([]));//[] - пустой массив
//console.log(inspect(1, []));
//console.log(inspect([],1));

const result = inspect(array);
console.log(result); // [ 7, 11, 7, 12 ]

exports.inspect = inspect;
