/**
 * Задача 1.
 *
 * Напишите функцию postpone, которая выводит в консоль счетчик с задержкой.
 *
 * Функция принимает 3 параметра:
 * - Первый параметр `start` — число, c которого начнется отсчет;
 * - Второй параметр `end` — верхний порог, до которого будет идти отсчет;
 * - Третий параметр `delay` — это время в `мс` между выводами.
 *
 * Условия:
 * - Функция принимает три параметра;
 * - Функция содержит валидацию входных параметров на тип number;
 * - Обязательно использование таймера setTimeout и цикла for;
 * - Функция должна уметь считать в обе стороны.
 */

// Решение
//Примечание, в задании не было ни слова про то, что функции должны работать последовательно, поэтому я не добавлял эту возможность.
function postpone(start, end, delay){
    if(typeof start != 'number' && typeof end != 'number' && typeof delay != 'number'){
        throw new Error('All parameters must be a numeric!');
    }
    let sign = 1;
    if(start > end){
        sign = -1;
    }
    for(let i = 0; i <= Math.abs(start-end); i++){
        setTimeout(()=>{console.log(start+i*sign)}, delay*i);
    }
}

postpone(1, 3, 1000);
// 1
// 2
// 3
postpone(3, 1, 1000);
// 3
// 2
// 1

exports.postpone = postpone;
